[
  {
    "id": "arc-001",
    "name": "Azure Arc-enabled Servers - Update Manager",
    "description": "Machines not configured for Azure Update Manager. Enable centralized update management for all Arc-enabled servers.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 8000,
    "details": "Azure Update Manager provides centralized patch management for Arc-enabled servers across on-premises, multi-cloud, and edge locations. Ensure compliance and security with automated update scheduling.",
    "activationSteps": "In Azure Portal, go to Azure Update Manager → Add machines → Select Arc-enabled servers to enable update management."
  },
  {
    "id": "arc-002",
    "name": "Azure Arc-enabled Servers - Inventory & Tracking",
    "description": "Machines not configured for Inventory and Change Tracking. Get visibility into software inventory and configuration changes.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 6000,
    "details": "Enable Change Tracking and Inventory to monitor software changes, file integrity, and Windows service changes on Arc-enabled servers. Essential for compliance and security.",
    "activationSteps": "Enable Change Tracking extension on Arc-enabled servers via Azure Portal → Automation → Change Tracking."
  },
  {
    "id": "arc-003",
    "name": "Azure Arc-enabled Servers - Guest Configuration",
    "description": "Machines not configured for Azure Policy Guest Configuration. Audit and enforce compliance policies on Arc servers.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 7000,
    "details": "Guest Configuration allows you to audit and enforce configuration standards across Arc-enabled servers. Monitor OS settings, installed applications, and security baselines.",
    "activationSteps": "Assign Azure Policy definitions with Guest Configuration to Arc-enabled servers in Azure Policy service."
  },
  {
    "id": "arc-004",
    "name": "Azure Arc Best Practice Assessment",
    "description": "Run best practice assessments to optimize Arc-enabled server configurations and identify security gaps.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 5000,
    "details": "Best Practice Assessments analyze Arc-enabled servers for security vulnerabilities, performance optimization, and compliance with Microsoft recommendations.",
    "activationSteps": "Enable Azure Advisor recommendations for Arc-enabled servers and review assessment reports in Azure Portal."
  },
  {
    "id": "arc-006",
    "name": "Arc-enabled Servers - Monitoring & Insights",
    "description": "Enable Azure Monitor and VM Insights for Arc-enabled servers to track performance and health.",
    "category": "free",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 4000,
    "details": "Monitor performance metrics, logs, and dependencies for Arc-enabled servers using Azure Monitor. Get insights into CPU, memory, disk, and network utilization.",
    "activationSteps": "Install Azure Monitor Agent on Arc-enabled servers and configure data collection rules in Azure Monitor."
  },
  {
    "id": "arc-007",
    "name": "Arc-enabled Servers - Microsoft Defender for Cloud",
    "description": "Protect Arc-enabled servers with Microsoft Defender for Cloud. Detect threats and vulnerabilities across hybrid infrastructure.",
    "category": "security",
    "isFree": false,
    "isActive": true,
    "estimatedValue": 9000,
    "details": "Microsoft Defender for Cloud provides advanced threat protection, vulnerability assessment, and security recommendations for Arc-enabled servers.",
    "activationSteps": "Enable Defender for Servers plan in Microsoft Defender for Cloud and onboard Arc-enabled machines."
  },
  {
    "id": "arc-008",
    "name": "Arc-enabled Servers - Automated Machine Configuration",
    "description": "Use Azure Automation to deploy and manage configurations across Arc-enabled servers at scale.",
    "category": "deployment",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 5500,
    "details": "Automate configuration management, script execution, and desired state configuration (DSC) for Arc-enabled servers using Azure Automation.",
    "activationSteps": "Create Automation Account and link Arc-enabled servers for configuration management."
  }
]
