[
  {
    "id": "arc-001",
    "name": "Azure Arc-enabled Servers - Update Manager",
    "description": "Machines not configured for Azure Update Manager. Enable centralized update management for all Arc-enabled servers.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 8000,
    "details": "Azure Update Manager provides centralized patch management for Arc-enabled servers across on-premises, multi-cloud, and edge locations. Ensure compliance and security with automated update scheduling.",
    "activationSteps": "In Azure Portal, go to Azure Update Manager → Add machines → Select Arc-enabled servers to enable update management."
  },
  {
    "id": "arc-002",
    "name": "Azure Arc-enabled Servers - Inventory & Tracking",
    "description": "Machines not configured for Inventory and Change Tracking. Get visibility into software inventory and configuration changes.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 6000,
    "details": "Enable Change Tracking and Inventory to monitor software changes, file integrity, and Windows service changes on Arc-enabled servers. Essential for compliance and security.",
    "activationSteps": "Enable Change Tracking extension on Arc-enabled servers via Azure Portal → Automation → Change Tracking."
  },
  {
    "id": "arc-003",
    "name": "Azure Arc-enabled Servers - Guest Configuration",
    "description": "Machines not configured for Azure Policy Guest Configuration. Audit and enforce compliance policies on Arc servers.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 7000,
    "details": "Guest Configuration allows you to audit and enforce configuration standards across Arc-enabled servers. Monitor OS settings, installed applications, and security baselines.",
    "activationSteps": "Assign Azure Policy definitions with Guest Configuration to Arc-enabled servers in Azure Policy service."
  },
  {
    "id": "arc-004",
    "name": "Azure Arc Best Practice Assessment",
    "description": "Run best practice assessments to optimize Arc-enabled server configurations and identify security gaps.",
    "category": "security",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 5000,
    "details": "Best Practice Assessments analyze Arc-enabled servers for security vulnerabilities, performance optimization, and compliance with Microsoft recommendations.",
    "activationSteps": "Enable Azure Advisor recommendations for Arc-enabled servers and review assessment reports in Azure Portal."
  },
  {
    "id": "arc-005",
    "name": "Azure Hybrid Benefit for Arc Servers",
    "description": "Use existing Windows Server licenses with Software Assurance on Arc-enabled servers to reduce costs.",
    "category": "deployment",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 12000,
    "details": "Apply Azure Hybrid Benefit to Arc-enabled Windows Servers running in non-Azure environments to maximize license value and reduce operational costs.",
    "activationSteps": "Configure Hybrid Benefit settings in Azure Portal for each Arc-enabled Windows Server."
  },
  {
    "id": "arc-006",
    "name": "Arc-enabled Servers - Monitoring & Insights",
    "description": "Enable Azure Monitor and VM Insights for Arc-enabled servers to track performance and health.",
    "category": "free",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 4000,
    "details": "Monitor performance metrics, logs, and dependencies for Arc-enabled servers using Azure Monitor. Get insights into CPU, memory, disk, and network utilization.",
    "activationSteps": "Install Azure Monitor Agent on Arc-enabled servers and configure data collection rules in Azure Monitor."
  },
  {
    "id": "arc-007",
    "name": "Arc-enabled Servers - Microsoft Defender for Cloud",
    "description": "Protect Arc-enabled servers with Microsoft Defender for Cloud. Detect threats and vulnerabilities across hybrid infrastructure.",
    "category": "security",
    "isFree": false,
    "isActive": true,
    "estimatedValue": 9000,
    "details": "Microsoft Defender for Cloud provides advanced threat protection, vulnerability assessment, and security recommendations for Arc-enabled servers.",
    "activationSteps": "Enable Defender for Servers plan in Microsoft Defender for Cloud and onboard Arc-enabled machines."
  },
  {
    "id": "arc-008",
    "name": "Arc-enabled Servers - Automated Machine Configuration",
    "description": "Use Azure Automation to deploy and manage configurations across Arc-enabled servers at scale.",
    "category": "deployment",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 5500,
    "details": "Automate configuration management, script execution, and desired state configuration (DSC) for Arc-enabled servers using Azure Automation.",
    "activationSteps": "Create Automation Account and link Arc-enabled servers for configuration management."
  },
  {
    "id": "sa-001",
    "name": "Windows 365 Cloud PC Access",
    "description": "Deploy Windows desktops and apps on Azure with Windows 365. Included at no additional cost with active Software Assurance.",
    "category": "free",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 5000,
    "details": "Windows 365 provides a complete, personalized Windows experience from the cloud to any device. SA customers get access to Windows 365 Enterprise at no additional cost.",
    "activationSteps": "Visit the Microsoft 365 admin center and enable Windows 365 for your organization."
  },
  {
    "id": "sa-003",
    "name": "Extended Security Updates (ESU)",
    "description": "Get free Extended Security Updates for Windows Server and SQL Server after end of support.",
    "category": "security",
    "isFree": true,
    "isActive": true,
    "estimatedValue": 3000,
    "details": "Continue receiving critical security updates for legacy systems beyond their support lifecycle at no cost with active SA.",
    "activationSteps": "ESUs are automatically available through Windows Update for SA customers."
  },
  {
    "id": "sa-004",
    "name": "Home Use Program",
    "description": "Employees can purchase Microsoft 365 apps for personal use at a significant discount.",
    "category": "training",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 1500,
    "details": "The Home Use Program allows your employees to get Microsoft 365 for home use at deeply discounted rates, improving productivity and satisfaction.",
    "activationSteps": "Register your organization at the Home Use Program portal and distribute access codes to employees."
  },
  {
    "id": "sa-005",
    "name": "Planning Services",
    "description": "Get expert guidance for deployment planning, including 5-day planning sessions with Microsoft partners.",
    "category": "training",
    "isFree": false,
    "isActive": false,
    "estimatedValue": 8000,
    "details": "SA includes days of planning services per year to help plan deployments, migrations, and optimize your environment.",
    "activationSteps": "Contact your Microsoft account team or visit the Volume Licensing Service Center."
  },
  {
    "id": "sa-006",
    "name": "Training Vouchers",
    "description": "Access to e-learning courses and instructor-led training for IT professionals.",
    "category": "training",
    "isFree": false,
    "isActive": false,
    "estimatedValue": 4000,
    "details": "Training vouchers provide access to Microsoft Official Curriculum courses and e-learning platforms.",
    "activationSteps": "Redeem training vouchers through the Volume Licensing Service Center."
  },
  {
    "id": "sa-007",
    "name": "24/7 Technical Support",
    "description": "Priority support for break-fix issues with faster response times.",
    "category": "training",
    "isFree": false,
    "isActive": true,
    "estimatedValue": 2500,
    "details": "Get priority technical support with guaranteed response times for critical issues.",
    "activationSteps": "Access support through your Premier or Unified support portal."
  },
  {
    "id": "sa-012",
    "name": "SQL Server Developer Edition",
    "description": "Free SQL Server Developer Edition for non-production use.",
    "category": "free",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 2000,
    "details": "Full-featured SQL Server for development and testing environments at no cost.",
    "activationSteps": "Download from the Microsoft Evaluation Center or Visual Studio Subscriptions."
  },
  {
    "id": "sa-015",
    "name": "Windows Autopatch",
    "description": "Automated Windows and Microsoft 365 update management service for cloud-managed devices.",
    "category": "free",
    "isFree": true,
    "isActive": false,
    "estimatedValue": 7000,
    "details": "Microsoft-managed update service that keeps your Windows and Office apps current automatically with zero-touch deployment for Intune-managed devices.",
    "activationSteps": "Enable Windows Autopatch in the Microsoft Intune admin center."
  },
  {
    "id": "sa-011",
    "name": "Version Upgrade Rights",
    "description": "Automatically receive rights to new versions of software as they're released.",
    "category": "free",
    "isFree": true,
    "isActive": true,
    "estimatedValue": 8000,
    "details": "Stay current with the latest features and security updates at no additional cost.",
    "activationSteps": "Download new versions from the Volume Licensing Service Center as released."
  }
]
